# Рекурсивные алгоритмы и рекуррентные функции 

1. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = 2 при n ≤ 2;

F(n) = F(n − 1) + 2 · F(n − 2) при n > 2.
 
Чему равно значение функции F(5)? В ответе запишите только натуральное число.


2. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = 1 при n ≤ 2;

F(n) = 2  ·  F(n − 1) + F(n − 2) при n > 2.
 
Чему равно значение функции F(6)? В ответе запишите только натуральное число.

3. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = n + 1 при n ≤ 2;

F(n) = F(n − 1) + 3 · F(n − 2) при n > 2.

Чему равно значение функции F(4)? В ответе запишите только натуральное число.

4. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = 2 при n ≤ 2;

F(n) = 2 · F(n − 1) + F(n − 2) при n > 2.

Чему равно значение функции F(5)? В ответе запишите только натуральное число.

5. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = 2 при n ≤ 2;

F(n) = 2 · F(n − 1) + F(n − 2) при n > 2.

Чему равно значение функции F(5)? В ответе запишите только натуральное число.

6. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = n + 1 при n ≤ 2;

F(n) = F(n − 1) + 2 · F(n − 2) при n > 2.

Чему равно значение функции F(4)? В ответе запишите только натуральное число.

7. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = 2 при n ≤ 2;

F(n) = F(n − 1) + 3 · F(n − 2) при n > 2.

Чему равно значение функции F(5)? В ответе запишите только натуральное число.

8. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = n + 4 при n ≤ 2;

F(n) = F(n − 1) + F(n − 2) при n > 2.

Чему равно значение функции F(6)? В ответе запишите только натуральное число.

9. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = 1 при n ≤2;

F(n) = 2 × F(n −1) + F(n −2) при n> 2.

Чему равно значение функции F(6)? В ответе запишите только натуральное число.

10. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = n при n ≤ 2;

F(n) = F(n − 1) + 2×F(n − 2) при n > 2.

Чему равно значение функции F(6)? В ответе запишите только натуральное число.

11. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = n при n ≤ 2;

F(n) = F(n − 1) + 3×F(n − 2) при n > 2.

Чему равно значение функции F(6)? В ответе запишите только натуральное число.

22. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = n + 3 при n ≤ 2;

F(n) = F(n − 1) + F(n − 2) при n > 2.

Чему равно значение функции F(7)? В ответе запишите только натуральное число.

23. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = 1 при n ≤ 2;

F(n) = 2 · F(n − 1) + F(n − 2) при n > 2.

Чему равно значение функции F(7)? В ответе запишите только натуральное число.

24. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = 1 при n ≤ 2;

F(n) = F(n − 1) + 2 · F(n − 2) при n > 2.

Чему равно значение функции F(7)? В ответе запишите только натуральное число.

25. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = 1 при n ≤ 2;

F(n) = F(n − 1) + 3 · F(n − 2) при n > 2.

Чему равно значение функции F(7)? В ответе запишите только натуральное число.

26. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = 1 при n ≤2;

F(n) = F(n −1) + 2 × F(n −2) при n> 2.

Чему равно значение функции F(7)? В ответе запишите только натуральное число.

27. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = n при n ≤ 2;

F(n) = F(n − 1) × F(n − 2) при n> 2.

Чему равно значение функции F(6)? В ответе запишите только натуральное число.

28. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = n при n ≤ 2;

F(n) = F(n − 1) × F(n − 2) при n> 2.

Чему равно значение функции F(7)? В ответе запишите только натуральное число.

29. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = n при n ≤ 2;

F(n) = 3 × F(n − 1) − F(n − 2) при n> 2.

Чему равно значение функции F(6)? В ответе запишите только натуральное число.

20. Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:

F(n) = n − 1 при n ≤ 2;

F(n) = 3 × F(n − 1) − F(n − 2) при n> 2.

Чему равно значение функции F(6)? В ответе запишите только натуральное число.

21. Чему равна сумма всех чисел, напечатанных на экране при выполнении вызова F(1)?
void F(int n)

{

    cout << n;

    if (n < 5) {

        F(n + 1);

        F(n + 3);

    }

}
